   /*/----------------------!!!----------------------------/*/
  /*/ Before compilation Save with Encoding Windows 1251  /*/
 /*/              Saved in Encoding UTF-8                /*/
/*/-------------------------!!!-------------------------/*/
#include <stdio.h>
#include <stdlib.h>
#include "default_cfg.h"
                                 /////////////////////////////////////////////////////////////
#define _yellow SetColor(14,0); // жовний вивід тексту на екран + чорний фон               //
#define _red SetColor(12,0);   // червоний вивід тексту на екран + чорний фон             //
#define _green SetColor(10,0);// повернення зеленого виводу тексту на екран + чорний фон //
                             /////////////////////////////////////////////////////////////
#define N 10000
#define _files "Lab-11_2.txt"

void add_str(void){
	int k = 0; // зберігає кількість рядків, а потім позицію в середині файлу
	int m = 0; // серенида між рядками
	int size = 0; // сумарний обсяг пам’яті у байтах, який займає файл
	char buff[N]; // буфер для тимчасових даних, а пізніше для зберігання рядка який необхідно вставити в середину файла
	char start[N]; // дані з файла від початку і до середини
	char end[N]; // дані з файла від середини і до кінця
	FILE *f; // вказівник на файл

	f = fopen(_files, "a+"); // Відкрити файл якщо файл не існує, то він створюється
	if(f == NULL)
	{
		Error_RED();
		printf("Невдалось відкрити файл %s\n", _files);
		end_cfg();
		exit(1);
	}

fseek(f, 0, 2); // позиція в кінці файла
size = ftell(f); // збереження сумарного обсягу пам’яті у байтах, який займає файл
fseek(f, 0, 0); // позиція на початку файла 
while(fgets(buff,N,f)){k++;} // лічильник кільклсті рядків

m = (float)k/2; // знаходження середини по рядкам

fseek(f, 0, 0); // позиція на початку файла 

k = 0; // онулення лічильника
while(fgets(buff,N,f)) // читання файла до середини
{
	k++;
	if (k == m)
	{
		break;
	}

}
k = ftell(f); // збереження позиції середини


fseek(f, 0, 0); // позиція на початку файла 


buff[0]=0; // очистка масива
start[0]=0;// очистка масива
do {
fgets(buff,N,f); // копіювання рядка з файла в масив
strcat(start, buff); // обєднання рядків в один масив
} while (ftell(f) < k); // цикл до середини файла


buff[0]=0;// очистка масива
end[0]=0;// очистка масива
fseek(f, k, 0); // позиція в середині файла
do {
fgets(buff,N,f); // копіювання рядка з файла в масив
strcat(end, buff); // обєднання рядків в один масив
} while (ftell(f) < size); // цикл до кінця файла

fclose(f); // закриття файла

printf("\nВведіть речення яке потрібпо дописати в середину файла:\n");
_yellow
gets(buff); // введення реченя яке потрібно дописати в середину файла
_green
strcat(buff, "\n"); // добавит до введеного речення перехід на новий рядок

f = fopen(_files, "w"); // Перезаписати існуючий текстовий файл для запису
	if(f == NULL)
	{
		Error_RED();
		end_cfg();
		exit(1);
	}

	fputs(start, f); // запис у файл вмісну оригіналу від початкі і до середини
	fputs(buff, f); // запис у файл рядка який потрібно було ввести в середину файла
	fputs(end, f); // запис у файл вмісту від середини оригіналу і до кінця
	fclose(f); // закриття файла
}

int main()
{
	start_cfg(); // default_cfg.h
	add_str();
	end_cfg(); // default_cfg.h
	return 0;
}